package Task1;

/*
    Абсолютно плохо прописаное задание. Нельзя определить что от нас требуется, так что ето проблема создателей ТЗ.
    Данное ТЗ я отправляю обратно на переработку.

    Создать имитационную модель «причал морских катеров». Необходимо вводить следующую информацию:
    1. Среднее время между появлениями пассажиров
    на причале в разное время суток;
    2. Среднее время между появлениями катеров на причале в разное время суток;
    3. Тип остановки катер (конечная или нет).
    Необходимо определить:
    1. Среднее время пребывание человека на остановке;
    2. Достаточный интервал времени между приходами
    катеров, чтобы на остановке находилось не более N
    людей одновременно;
    3. Количество свободных мест в катере является случайной величиной.
 */
public class SeaBoatsMooring {
    private int passengerArrivalAverageTime;
    private int boatArrivalAverageTime;
}
